{
  "professionals": [
    {
      "fullName": "Abdul Majid",
      "profession": "Senior Consultant",
      "image": "/images/aboutDetails-img.avif",

      "content": [
        {
          
          "heading": "Summary",
          "text": "Majid possesses extensive expertise in engineering and construction contracts, including contractual correspondence, claims management, and dispute resolution support. He has been engaged multiple times to provide expert advice on project claims, contract interpretation, and independent opinions regarding delay and disruption entitlements. His work spans various sectors, including infrastructure, building, marine, oil and gas, and heavy industrial projects, where he utilizes critical path analysis to assess complex delay disputes and prepares pre-arbitral and expert reports based on factual evidence and contractual entitlements. Majid has been appointed as a programming expert on major projects across the UK, Qatar, UAE, Poland, and Pakistan, offering specialized contractual support that encompasses managing complex claims and preparing responses to unfavorable determinations <br/> With a strong track record in dispute resolution support, Majid assists employers, contractors, and subcontractors in navigating the complexities of construction disputes. His expertise not only aids in effective negotiation and Alternative Dispute Resolution (ADR) processes but also strengthens clients' positions during litigation. By developing compelling correspondence and well-researched expert reports, he provides critical insights that empower clients to confidently address and resolve complex construction issues",
          "width":"w-full"
        },
        {
          "heading": "Professional Qualifications",
          "text": "Associate Member of Chartered Institute of Arbitrators, United Kingdom, 2012 Bachelor’s of Engineering [Civil], N.E.D. University of Engineering & Technology, 1987 Registered Professional Engineer, 1987 Primavera Project Planner Certification Accredited by National University of Science & Technology Certified user of Primavera Project Planner - Pakistan Navy Engineering College",
          "width":"w-full"
        
        },
        {
          "heading": "Affiliations",
          "text": "Member of Construction Law Society (Gulf), 2009 Member Pakistan Engineering Council, 1987",
         "width":"30%"
        },
        {
          "heading": "Area of Expert Services",
          "text": "Drafting and advising on appropriate form of contracts, conducting contract analysis and strategy development, and managing services related to delays and disruptions. He handles contractual correspondence and delivers written opinions, while also offering prompt advice on planning and programming issues, delays, delayed payment bills, completion, termination, and defects. His expertise extends to implementing claim avoidance and prevention strategies, providing advice on construction disputes and resolutions, conducting independent reviews and assessments for multi-party disputes, formulating case strategies and visual communication for tribunals, as well as managing distribution contracts, commercial agreements, and negotiations. Synopsis",
          "width":"67%"
          
        },
        {
          "heading": "Construction / Claims Experience",
          "text": "Majid has over 24 years of experience on infrastructure, buildings, industrial and oil and gas projects in the United Kingdom, Saudi Arabia, Pakistan, Qatar, and United Arab Emirates",
          "width":"30%"
        },
        {
          "heading": "Clients / Consultancy Appointments",
          "list": [
            "Bauer Spezialtiefbau GmbH, UAE",
            "AAA Partnership, Pakistan (Project Performance Audits)",
            "Keller International – Grundbau, GmbH, UAE",
            "Instrumentation & Management Systems, Pakistan, UAE",
            "E.C. Harris, London, UK",
            "JS Enterprise & Hi-Tech Engineering, Pakistan",
            "Lagan Construction, UK, Pakistan",
            "Highway Engineers, Pakistan",
            "Technical Associates, Pakistan",
            "Osmani and Company, Pakistan",
            "Al Tariq Constructors, Pakistan",
            "Hill International, Saudi Arabia",
            "Maqbool Associates, Pakistan",
            "IK Associates, Pakistan",
            "China Harbour Engineering Co., Pakistan",
            "Matracon Construction, Pakistan",
            "Taisei Corporation, Japan",
            "FWO, Frontier Works Organization, Pakistan",
            "CTI Engineering, Japan",
            "KAPEC-Kashmir Pre-Engineered Construction Pvt. Ltd",
            "JS Enterprise, Pakistan",
            "Hi Tech Pipe & Engineering Industries Pvt. Ltd, Pakistan",
            "Gulf Constructors Pvt. Ltd, Pakistan",
            "Ramzan & Sons Pvt. Ltd, Pakistan",
            "Engineering Consultants International Ltd"
          ],
          "width":"30%"
        
        },
        {
          "heading": "Project Management, Cost & Time Control; and Contract Administration",
          "list": [
            "United Arab Emirates, Abu Dhabi – Abu Dhabi Mall",
            "United Arab Emirates, Abu Dhabi – ADMA APCO Building Extension",
            "United Arab Emirates, Dubai – Dubai International Airport, Control Tower",
            "United Arab Emirates, Dubai – Jebel Ali Power and Desalination Plant",
            "United Arab Emirates, Fujairah – Fujairah Power and Desalination Plant",
            "United Arab Emirates, Fujairah – Fujairah Port Expansion",
            "United Arab Emirates, RAK – Ras Al Khaimah Cement Plant",
            "United Arab Emirates, Dubai – Business Park Buildings",
            "United Arab Emirates, Dubai – Dubai Mall Hotel",
            "United Arab Emirates, Dubai – Dubai Mall",
            "United Arab Emirates, Dubai – Waves Residential High Rise Building",
            "United Arab Emirates, Dubai – Jumeirah Lake View – Various High Rise Building projects",
            "Oman – Barka Power and Desalination Plant",
            "Saudi Arabia, Taif – King Fahad Air Force Base",
            "Bahrain – Bahrain Causeway Bridge",
            "Qatar- New Doha International Airport",
            "Pakistan, Port Qasim – FATCO Oil Terminal",
            "Pakistan - 80km Pressure Pipeline Port Qasim – Hub Power Thermal Station",
            "Pakistan - BLT Telecommunication 182 K line – Karachi, Hyderabad and Quetta",
            "Pakistan, Karachi – New Quaid–e–Azam International Airport, Karachi",
            "Pakistan, Islamabad – New French Embassy, Islamabad",
            "Pakistan, Islamabad – OPFE Head Office Building, Islamabad"
          ],
          "width":"w-full"
        },
        {
          "heading": " Particular Commissions and Appointments as <br /> Contracts Advisor / Claims Consultant and Assistance in Dispute Resolution",
          "text": "Majid has authored and co-authored numerous articles, research papers, and books on contracting, dispute resolution, and delays. He has also published a book titled 'The Art of Negotiation and Alternative Dispute Resolution' (2005) and a book titled 'Negotiation and Alternative Dispute Resolution: A Comprehensive Guide' (2013). His publications have been featured in various industry publications, including the UK's 'Construction Law Society' magazine, the 'Business & Management' magazine, and the 'Project Management Journal' magazine.",
         
          "list": [
            "Pakistan – NHA N-70 (RakhiGajj- Bewata Section) 33.84 Km, Package-1 , D.G. Khan",
            "Pakistan – Bill Gates Health Care Hospital, Lahore",
            "Pakistan - 50-cuses Drainage of Waste Water / Effluent Channel Thar Coal, Sindh",
            "Pakistan - Sewage Treatment Plant TP I & TP II, Greater Karachi Sewerage Plan S-III",
            "Pakistan - Greater Karachi Bulk Water Supply Scheme K-IV Phase-1, Karachi",
            "Pakistan - Construction of Mangi Dam and Water Conveyance System – Package IIA",
            "Pakistan - Gharo Pumping Station to Forebay 65 MGD Water Supply Scheme - Haleji to Pipri",
            "Pakistan – Deep Water Container Terminal Port, Keamari",
            "Pakistan – Deep Water Container Terminal Port, Keamari",
            "Pakistan – Port Qasim Container Terminal, Port Qasim",
            "Pakistan – Turkish Housing Flood Effectives Scheme, Thatta",
            "Pakistan – New Benazir Bhutto International Airport",
            "Pakistan - Mubarak Centre, Lahore",
            "United Arab Emirates – City of Arabia, Malik Towers, Ritz Carlton Hotel",
            "United Arab Emirates – Royal Amwaj, East Hotel Jafza, Iris Crystal Towers",
            "United Arab Emirates – Waves Multi –storied Building",
            "United Kingdom - Mitsui Petrochemical Plant",
            "United Kingdom – River Thames – Maidenhead Flood Alleviations Scheme",
            "United Kingdom - Maison Do’r Mansion",
            "Poland - Wola Park Supermarket",
            "Qatar – Gas Pipeline/LNG Plant",
            "United Arab Emirates - Fujairah - Power and Desalination Plant",
            "United Arab Emirates - Khorfakkan Harbour Extension and Container Terminal",
            "United Arab Emirates - Abu Dhabi Trade Centre",
            "United Arab Emirates - ADMA APCO Head Office Building",
            "Pakistan - 80 km Hub River Fuel Oil Pipeline and Affiliated Facilities project",
            "Saudi Arabia, Riyadh – King Abdullah Petroleum and Research Center (‘KAPSARC’)",
            "Pakistan, D.G. Khan - NHA N-70 (RakhiGajj- Bewata Section) 33.84 Km, Package-1",
            "Pakistan, Shaukat Khanum Hospital project, Karachi",
            "Pakistan, Port Qasim Industrial Road works project, Port Qasim",
            "Pakistan, Malir Expresss Way project, Karachi",
            "Pakistan, University College Dera Murad Jamali",
            "Pakistan, Development Package Quetta",
            "Pakistan, Karachi Neighbourhood Improvement Project (KNIP)",
            "Pakistan, Medical College & Hospital Loralai (Phase-II)",
            "Pakistan, Sindh Secondary Education Improvement Projects (SSEIP) funded by ADB",
            "Pakistan, Emergency Flood Assistance Project (EFAP-WSD-CW-16) funded by ADB"
          ],
          "width":"w-full"
        },
  
        {
          "heading": "Particular Forensic Programming, Delay Analysis and Independent Review Expertise",
          "text": "Related engagements and commissions included various planning, scheduling and delay analysis work supporting project management teams and legal advisors across a number of construction segments. This was mostly to provide modelled time impact analysis, impacted as-planned analysis and collapsed as – built analysis methodologies and expert reports in assessing and validating interim and final extension of time and prolongation cost entitlements. The work also involved evaluation and compilation of supporting documentation for facts relied upon and drafting of relevant narratives; developing contractual arguments and preparation of relevant narratives including independent review of party’s positions by conducting contemporaneous and retrospective delay investigations.",
          "width":"w-full"
        },
       
        {
          "heading": "Expert Reports / Briefs prepared for Clients",
          
          "list": [
            "Claim preparation for delay and disruption entitlement of the contractor for engineer’s determination.",
            "Project performance audit - overall evaluation, recommendations on time, cost and quality improvements for multiple contractors / subcontractors.",
            "Expert report on time extensions & disruption costs in contemplation of dispute resolution board proceedings.",
            "Expert reports containing retrospective delay analysis and defence against claims by other parties.",
            "Reports in the matters of contract, extension of time controversies and determination of liquidated damages.",
            "Reports concerning contractor’s entitlement and re-assessment of interim and final time extension.",
            "Reports containing independent review on parties’ liabilities and entitlement positions concerning delays, disruption including matters of quantification of concurrent and sequential delays & re-assessment of Eot’s in contemplation of arbitration proceedings.",
            "Report on assistance to the project manager in the assessment and evaluation of claims.",
            "Preliminary interim reports on extended contract time periods and prolongation costs in multi-party disputes.",
            "Report on analysis of contractor’s entitlement to time extension, direct and in-direct costs / loss of productivity analysis.",
            "Interim report on matters of delay claims, design and defects liability of parties.",
            "Review & assistance to developer in the assessment and evaluation of claims and arbitrator’s expert opinion.",
            "Briefs and advisory narratives for overall direction on multiparty contractual entitlement and disputes, required mitigation measures, to owners, project managers and contractors on high value projects."
          ],
          "width":"30%"
        },
        {
          "heading": "Professional Career",
          "list":[
            "Aurtel Consulting Group FZE 2011 – to-date",
            "Hill International – Saudi Arabia 2015 - 2015",
            "Juma Al Majid Group – UAE 2005 - 2010",
            "Al Ghurair Group – UAE 2004 - 2005",
            "EC Harris – United Kingdom 2002 – 2003",
            "Besix – Belgium - UAE 1997 – 2002",
            "Promet Engineering – Singapore 1994 – 1996",
            "Alcatel – France 1992 – 1994",
            "Sogea – France 1991 – 1992",
            "Al Mabani – Saudi Arabia 1990 – 1991",
            "Interhom – Pakistan 1988 – 1990"
          ],
          "width":"30%"
        },
        
        {
          "heading": "Seminars/Workshops",
          "text": "Principles of Management Course <br/>Sales Management Course <br/>ISO – 2009 Certification Course <br/>Society of Construction Law (Gulf) – Contract claims and dispute resolution related seminars",
          "width":"w-full"
   
        },
        {
          "heading": "Contact Details",
          "text": "Email: <span className'text-primary underlinded'> abdulmajid.aurtel11@gmail.com</span> <br/> Mobile Contact: (0092) 3362235878, Pakistan",
          "width":"w-full"
        }
      ]
    }
  ]
}
